<a href="https://colab.research.google.com/github/NigelWanga/Moringa/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2021_08_Nigel_Matalanga_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.0 Importing Pandas and Numpy Library

In [ ]:
#Importing pandas
#
import pandas as pd

#Importing Numpy
#
import numpy as np

# 1.1 Loading our Datasets

In [ ]:
#loading cells_geo
#

df = pd.read_csv('cells_geo.csv')
df.head(10)

  ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0  0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1  1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2  2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3  3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4  4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
5  5;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
6  6;KRIKOREA;In Service;INTERIEUR;Grand-OUEST;"K...
7  7;ABOBO;In Service;ABIDJAN;"""Abidjan_NORD";NP...
8  8;ABOBO;In Service;ABIDJAN;"""Abidjan_NORD";NP...
9  9;ABOBO;;ABIDJAN;"""Abidjan_NORD";NPONON;-4.02...

In [ ]:
#loading cells_geo_desc
#
df1 = pd.read_excel('cells_geo_description.xlsx')
df1.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [ ]:
#loading CDR_desc
#
df2 = pd.read_excel('CDR_description.xlsx')
df2.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [ ]:
#loading Telcom Dataset 1
#
TelDS1 = pd.read_csv('http://bit.ly/Telcom_dataset1')
TelDS1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#loading Telcom Dataset 2
#
TelDS2 = pd.read_csv('http://bit.ly/Telcom_dataset2')
TelDS2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
#loading TElcom Dataset 3
#
TelDS3 = pd.read_csv('http://bit.ly/Telcom_dataset3')
TelDS3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

#1.2 Performing our Operations

##1.2.1 Cleaning our Data

In [ ]:
#cleaning cells_geo
#
df = pd.read_csv('cells_geo.csv')
df.head(10)

# Identify which observations are duplicates
df.duplicated()

# Drop duplicates
df.drop_duplicates()

# Checking if there are missing values in your data
df.isnull()

# Drop missing observations
df_no_missing = df.dropna()
df_no_missing

# Drop column if they only contain missing values
df.dropna(axis=1, how='all')

     ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0     0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1     1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2     2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3     3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4     4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
...                                                 ...
3969  3969;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3970  3970;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3971  3971;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3972  3972;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3973  3973;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...

[3974 rows x 1 columns]

In [ ]:
#trying something here
df_ = df = pd.read_csv('cells_geo.csv')
df.head(10)

# Identify which observations are duplicates
df.duplicated()

# Drop duplicates
df.drop_duplicates()

# Checking if there are missing values in your data
df.isnull()

# Drop missing observations
df_no_missing = df.dropna()
df_no_missing

# Drop column if they only contain missing values
df.dropna(axis=1, how='all')
print(df_)

     ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0     0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1     1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2     2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3     3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4     4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
...                                                 ...
3969  3969;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3970  3970;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3971  3971;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3972  3972;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3973  3973;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...

[3974 rows x 1 columns]

In [ ]:
#cleaning cells_geo_desc
#
df1 = pd.read_excel('cells_geo_description.xlsx')
df1.head(13)
#no clean required

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [ ]:
#trying something here
df_1 = df1 = pd.read_excel('cells_geo_description.xlsx')
df1.head(13)
df1.dropna(axis=1, how='all')
print(df_1)

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [ ]:
#cleaning CDR_desc
#
df2 = pd.read_excel('CDR_description.xlsx')
df2.head(10)
#no clean required

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
#trying something here
df_2 = df2 = pd.read_excel('CDR_description.xlsx')
df2.head(10)
df2.dropna(axis=1, how='all')
print(df_2)

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
#loading Telcom Dataset 1
#
TelDS1 = pd.read_csv('http://bit.ly/Telcom_dataset1')
TelDS1.head()

# Identify which observations are duplicates
TelDS1.duplicated()

# Drop duplicates
TelDS1.drop_duplicates()

# Checking if there are missing values in your data
TelDS1.isnull()

# Drop missing observations
TelDS1_no_missing = TelDS1.dropna()
TelDS1_no_missing

# Drop column if they only contain missing values
TelDS1.dropna(axis=1, how='all')

#dropping columns
TelDS1.drop(['COUNTRY_A', 'COUNTRY_B', 'SITE_ID', 'CELL_ON_SITE', 'DW_A_NUMBER_INT', 'CELL_ID', 'DW_B_NUMBER_INT'],  axis=1)

     PRODUTC  VALUE               DATETIME
0      Voice      0  2012-05-06 23:04:37.0
1        sms      0  2012-05-06 23:05:25.0
2        sms     25  2012-05-06 23:05:41.0
3      Voice     56  2012-05-06 23:05:42.0
4      Voice     14  2012-05-06 23:06:29.0
...      ...    ...                    ...
4996     sms    100  2012-05-07 00:01:54.0
4997   Voice      1  2012-05-07 00:01:54.0
4998   Voice      0  2012-05-07 00:01:54.0
4999   Voice      0  2012-05-07 00:01:54.0
5000   Voice      7  2012-05-07 00:01:54.0

[5001 rows x 3 columns]

In [ ]:
#assiging Telcomdataset1
#
TelDS11 = TelDS1.drop(['COUNTRY_A', 'COUNTRY_B', 'SITE_ID', 'CELL_ON_SITE', 'DW_A_NUMBER_INT', 'CELL_ID', 'DW_B_NUMBER_INT'],  axis=1)
print(TelDS11)

     PRODUTC  VALUE               DATETIME
0      Voice      0  2012-05-06 23:04:37.0
1        sms      0  2012-05-06 23:05:25.0
2        sms     25  2012-05-06 23:05:41.0
3      Voice     56  2012-05-06 23:05:42.0
4      Voice     14  2012-05-06 23:06:29.0
...      ...    ...                    ...
4996     sms    100  2012-05-07 00:01:54.0
4997   Voice      1  2012-05-07 00:01:54.0
4998   Voice      0  2012-05-07 00:01:54.0
4999   Voice      0  2012-05-07 00:01:54.0
5000   Voice      7  2012-05-07 00:01:54.0

[5001 rows x 3 columns]

In [ ]:
#cleaning Telcom Dataset 2
#
TelDS2 = pd.read_csv('http://bit.ly/Telcom_dataset2')
TelDS2.head(10)

# Identify which observations are duplicates
TelDS2.duplicated()

# Drop duplicates
TelDS2.drop_duplicates()

# Checking if there are missing values in your data
TelDS2.isnull()

# Drop missing observations
TelDS2_no_missing = TelDS2.dropna()
TelDS2_no_missing

# Drop column if they only contain missing values
TelDS2.dropna(axis=1, how='all')

#dropping columns
TelDS2.drop(['COUNTRY_A', 'COUNTRY_B', 'SITE_ID', 'CELL_ON_SITE', 'DW_A_NUMBER', 'CELL_ID', 'DW_B_NUMBER'],  axis=1)

     PRODUCT  VALUE              DATE_TIME
0        sms      0  2012-05-07 23:02:06.0
1      Voice      0  2012-05-07 23:03:44.0
2        sms      0  2012-05-07 23:04:06.0
3      Voice     37  2012-05-07 23:04:48.0
4        sms     25  2012-05-07 23:04:58.0
...      ...    ...                    ...
4996     sms      0  2012-05-08 00:01:53.0
4997     sms     25  2012-05-08 00:01:53.0
4998     sms      0  2012-05-08 00:01:53.0
4999    data      0  2012-05-08 00:01:53.0
5000   Voice      0  2012-05-08 00:01:53.0

[5001 rows x 3 columns]

In [ ]:
#assiging Telcomdataset2
#
TelDS22 = TelDS2.drop(['COUNTRY_A', 'COUNTRY_B', 'SITE_ID', 'CELL_ON_SITE', 'DW_A_NUMBER', 'CELL_ID', 'DW_B_NUMBER'],  axis=1)
print(TelDS22)

     PRODUCT  VALUE              DATE_TIME
0        sms      0  2012-05-07 23:02:06.0
1      Voice      0  2012-05-07 23:03:44.0
2        sms      0  2012-05-07 23:04:06.0
3      Voice     37  2012-05-07 23:04:48.0
4        sms     25  2012-05-07 23:04:58.0
...      ...    ...                    ...
4996     sms      0  2012-05-08 00:01:53.0
4997     sms     25  2012-05-08 00:01:53.0
4998     sms      0  2012-05-08 00:01:53.0
4999    data      0  2012-05-08 00:01:53.0
5000   Voice      0  2012-05-08 00:01:53.0

[5001 rows x 3 columns]

In [ ]:
#cleaning TElcom Dataset 3
#
TelDS3 = pd.read_csv('http://bit.ly/Telcom_dataset3')
TelDS3.head(10)

# Identify which observations are duplicates
TelDS3.duplicated()

# Drop duplicates
TelDS3.drop_duplicates()

# Checking if there are missing values in your data
TelDS3.isnull()

# Drop missing observations
TelDS3_no_missing = TelDS3.dropna()
TelDS3_no_missing

# Drop column if they only contain missing values
TelDS3.dropna(axis=1, how='all')

#dropping columns
TelDS3.drop(['COUNTRY_A', 'COUNTRY_B', 'SIET_ID', 'CELL_ON_SITE', 'DW_A_NUMBER_INT', 'CELLID', 'DW_B_NUMBER_INT'],  axis=1)

     PRODUCT  VALUE              DATE_TIME
0      Voice     61  2012-05-08 23:01:28.0
1        sms      0  2012-05-08 23:01:31.0
2      Voice     10  2012-05-08 23:02:59.0
3        sms      0  2012-05-08 23:03:04.0
4      Voice     22  2012-05-08 23:03:16.0
...      ...    ...                    ...
4996   Voice      0  2012-05-09 00:01:43.0
4997   Voice     62  2012-05-09 00:01:43.0
4998   Voice     32  2012-05-09 00:01:43.0
4999   Voice     30  2012-05-09 00:01:43.0
5000   Voice     60  2012-05-09 00:01:43.0

[5001 rows x 3 columns]

In [ ]:
#assigning Telcomdataset3
#
TelDS33 = TelDS3.drop(['COUNTRY_A', 'COUNTRY_B', 'SIET_ID', 'CELL_ON_SITE', 'DW_A_NUMBER_INT', 'CELLID', 'DW_B_NUMBER_INT'],  axis=1)
print(TelDS33)

     PRODUCT  VALUE              DATE_TIME
0      Voice     61  2012-05-08 23:01:28.0
1        sms      0  2012-05-08 23:01:31.0
2      Voice     10  2012-05-08 23:02:59.0
3        sms      0  2012-05-08 23:03:04.0
4      Voice     22  2012-05-08 23:03:16.0
...      ...    ...                    ...
4996   Voice      0  2012-05-09 00:01:43.0
4997   Voice     62  2012-05-09 00:01:43.0
4998   Voice     32  2012-05-09 00:01:43.0
4999   Voice     30  2012-05-09 00:01:43.0
5000   Voice     60  2012-05-09 00:01:43.0

[5001 rows x 3 columns]

## 1.2.2 Merging DataFrames

In [ ]:
#merging the Telcom Datasets
#

pd.concat([df_, df_1, df_2, TelDS11, TelDS22, TelDS33], axis=1)

     ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE  ...              DATE_TIME
0     0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:01:28.0
1     1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:01:31.0
2     2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:02:59.0
3     3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...                                                ...  2012-05-08 23:03:04.0
4     4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...                                                ...  2012-05-08 23:03:16.0
...                                                 ...                                                ...                    ...
4996                                                NaN                                                ...  2012-05-09 00:01:43.0
4997                                                NaN                                                ...  2012-05-09 00:01:43.0
4998                                                NaN                                                ...  2012-05-09 00:01:43.0
4999                                                NaN                                                ...  2012-05-09 00:01:43.0
5000                                                NaN                                                ...  2012-05-09 00:01:43.0

[5001 rows x 16 columns]

In [ ]:
#trying to merge the dataframes differently
#
frames = [df, df1, df2, TelDS11, TelDS22, TelDS33]

pd.concat(frames, axis=1)

     ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE  ...              DATE_TIME
0     0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:01:28.0
1     1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:01:31.0
2     2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...                                                ...  2012-05-08 23:02:59.0
3     3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...                                                ...  2012-05-08 23:03:04.0
4     4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...                                                ...  2012-05-08 23:03:16.0
...                                                 ...                                                ...                    ...
4996                                                NaN                                                ...  2012-05-09 00:01:43.0
4997                                                NaN                                                ...  2012-05-09 00:01:43.0
4998                                                NaN                                                ...  2012-05-09 00:01:43.0
4999                                                NaN                                                ...  2012-05-09 00:01:43.0
5000                                                NaN                                                ...  2012-05-09 00:01:43.0

[5001 rows x 16 columns]

##1.2.3 Analysing

In [ ]:
#Which ones were the most used city for the three days?
#

vil = df(index=['VILLES'], aggfunc='count')
vil['CELL_ID'].nlargest(10)

TypeError: ignored

In [ ]:
#Which cities were the most used during business and home hours?
#
vil = frames(index=[['VILLES'],['DATETIME']], aggfunc='count')
vil['CELL_ID'].nlargest(10)

TypeError: ignored

In [ ]:
#Most used city for the three days?
#
vil = df(index=['VILLES'], aggfunc='count')
vil['CELL_ID'].nlargest(10)

TypeError: ignored